
![image](../Utilities/pandas_logo.png)

__Author: Christian Camilo Urcuqui LÃ³pez__

__Date: 14 August 2018__


# Pandas

Pandas is an open source library which allows us to use data structures and data analysis for the Python language. The Panda's project URL is https://pandas.pydata.org/

In this notebook we will see the essential functions to analyze data through the Pandas library in Python, moreover, we are going to see the first steps in an EDA (Exploratory Data Analysis) approach since how to load the data until how find the insights in our datasets. Pandas provides data structures and data manipulation tools to make data cleaning, an important process to apply in our data science projects.

The big difference between Pandas and NumPy is that is designed with tabular or heterogeneous data, NumPy is focused to homogeneous numerical array data.

This notebook allows us to introduce the first steps in the data science world with Python, the notebook content is divided into the next sections:

- [Import](#Import)
- [Data Structures](#Data-Structures)
    - [Series](#Series)
    - [DataFrame](#DataFrame)    
        + [Style a DataFrame](#Style-a-DataFrame)
- [Load data](#Load-data)
    - [Datasets available](#Datasets-available)
    - [Open source repositories](#Open-source-repositories)
        + [CSV](#CSV)
        + [EXCEL](#EXCEL)
        + [SQLite](#SQLite)        
    - [Rename columns](#Rename-columns)
    - [Change Column Types](#Change-Column-Types)
    - [Data Persistence](#Data-Persistence)
- [Exploration](#Exploration)
    + [Conditional selection](#Conditional-selection)
    + [Other operations](#Other-operations)  
- [Cleaning](#Cleaning)
- [References](#References)

## Import

In some open examples, the library is imported like the next code

In [60]:
import pandas as pd
pd.__version__

'0.24.0'

In the same way we can also import other important objects like Series and DataFrame into the local namespace

In [3]:
from pandas import Series, DataFrame

## Data Structures

It is important to be comfortable with the next workhorse data structures: Series and DataFrame.

### Series

A Series is a one-dimensional array with a sequence of values and an associated array of data labels (index).

In [19]:
serie = pd.Series([3,-8,"a"])

In [20]:
serie

0     3
1    -8
2     a
dtype: object

Pay attention we have indexes associated with each value in the array.

In [22]:
# this is the way to print the values of our series object
serie.values

array([3, -8, 'a'], dtype=object)

In [23]:
# this is the way to print the indexes 
serie.index

RangeIndex(start=0, stop=3, step=1)

We can change the values associated to each index during the creation of the series object

In [23]:
serie =  pd.Series([3, -8, 3], index=['a', 'b', 'c'])
serie

a    3
b   -8
c    3
dtype: int64

In [25]:
serie.index

Index(['a', 'b', 'c'], dtype='object')

These indexes allow us to access the values

In [26]:
serie['a']

3

In [24]:
serie['c'] = 'k'
serie

a     3
b    -8
c     k
dtype: object

In [29]:
serie[['c','a','b']] # we use a list of indexes, we can use strings instead of integers

c     k
a     3
b    -8
dtype: object

In [4]:
serie = pd.Series([3, -8, 3], index=['a', 'b', 'c']) # in order to make filters and other operations we will only use numbers
serie[serie > 0]

a    3
c    3
dtype: int64

In [38]:
serie * 2

a     6
b   -16
c     6
dtype: int64

In [5]:
import numpy as np
np.exp(serie)

a    20.085537
b     0.000335
c    20.085537
dtype: float64

In [40]:
'b' in serie

True

In [41]:
'k' in serie

False

We can make a Python dictionary and assign it in a Series object

In [42]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah':5000}
series = Series(sdata)
series

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Pay attention that the previous data dictionary was sorted by the Series Object, we can override this passing the dict keys in the order that we want to use it.

In [44]:
states = ['California','Ohio', 'Oregon', 'Texas']
series = Series(sdata, index=states)
series

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

See that in the previous example the values were located with their respective key into the dictionary, that is the reason that we have a NaN value for the 'California' index and the value 'Utah' wasn't included it.

Pandas provides us the methods to know the missing values in our dataset.

In [45]:
pd.isnull(series)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [46]:
pd.notnull(series)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In the same way the Series object provides us the previous methods.

In [48]:
series.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

The alignment of the indexes allows us to make operations between multiple Series objects.

In [53]:
series2 = Series(sdata)
print(series)
print()
print(series2)
print()
print(series + series2) ## in this case the results of any operation with NaN is NaN

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

The Series object has other attributes like its name and the name assigned to the index

In [54]:
series2.name = 'population'
series2.index.name = 'states'
series2

states
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

As you saw we can access to the index attribute, so we can change all the indexes through this.

In [56]:
series2.index = ['Kuky', 'Icesi', 'Morty', 'Rick']
series2

Kuky     35000
Icesi    71000
Morty    16000
Rick      5000
Name: population, dtype: int64

## DataFrame

This data structure represents a rectangular table of data and contains an ordered collection of columns (dataset), each column could have different kind of value type (string, numeric, boolean). DataFrame has not only the indexes by rows it has indexes for their columns. The data is stored as one or more two-dimensional blocks rather than a list, dictionary, or another two dimensional array.

In [26]:
# this is one way to make a dataframe with the same number of rows by each column
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data = DataFrame(data)
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Well, now the idea is to use the methods of Pandas and the attributes of the DataFrame in order to explore the information. The next method will print the first five registers, this is important because it allows us to print a first representation of the dataset.

In [27]:
data.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

You can sort the during the creation process of the DataFrame

In [60]:
DataFrame(data, columns=['year','pop', 'state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

If we didn't declare the values in a column we will have NaN registers.

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 =  DataFrame(data, columns=['year','state', 'pop',  'debt'],
                   index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [11]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Like a Series object we can see the values in a specific column.

In [12]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

If we want to print the values in a specific row by the index we can use the attribute loc or use iloc.

+ loc() receives a string index or an array of string indexes
+ iloc() receives the position index or an array of position indexes (int)

In [14]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [6]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt'  column could be assigned a scalar value or an array of values

In [9]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [12]:
# for this case the array or list must have the same lenght that match with length of the DataFrame
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [13]:
# look that in this case we use the index to illustrate where the value are going to be in the Data Frame
# and the rows that will not have values, which will have NaN
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

## Style a DataFrame


This is a trick if you want to change the display of your entire notebook, this approach is through using a style that is provided by a dictionary.

<img src="https://pbs.twimg.com/profile_images/640849368363368448/TTDeHHWl_400x400.jpg" height="50"/>

In [91]:
# I'm going to use the dataset from the repository: https://www.kaggle.com/camnugent/sandp500/
# https://raw.githubusercontent.com/not4win/MLfinance/master/all_stocks_5yr.csv
df = pd.read_csv("../Datasets/all_stocks_5yr.csv", parse_dates=['Date'])
df.columns = [col.lower() for col in df.columns]
df = df.loc[:,['date','close','volume','name']].copy()
df = df.head().copy()
df.style

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
date      5 non-null datetime64[ns]
close     5 non-null float64
volume    5 non-null int64
name      5 non-null object
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 240.0+ bytes

In [96]:
format_dict = {'date':'{:%m/%d/%y}', 'close':'${:.2f}','volume':'{:,}'}

In [97]:
df.style.format(format_dict)

We can apply more styling with other methods.

In [102]:
(df.style.format(format_dict)
    .hide_index()
    .highlight_min('close', color='red')
    .highlight_max('close', color='green')
)

In [106]:
(df.style.format(format_dict)
    .hide_index()
    .background_gradient(subset='close', cmap='Blues')
)

In [107]:
(df.style.format(format_dict)
    .hide_index()
    .bar('volume', color='lightblue', align='zero')
    .set_caption('Stock Prices from 2013')
)

Let's see more examples proposed at https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html

In [1]:
import pandas as pd
import numpy as np

np.random.seed(24)
df = pd.DataFrame({'A': np.linspace(1, 10, 10)})
df = pd.concat([df, pd.DataFrame(np.random.randn(10, 4), columns=list('BCDE'))],
               axis=1)
df.iloc[0, 2] = np.nan
df

      A         B         C         D         E
0   1.0  1.329212       NaN -0.316280 -0.990810
1   2.0 -1.070816 -1.438713  0.564417  0.295722
2   3.0 -1.626404  0.219565  0.678805  1.889273
3   4.0  0.961538  0.104011 -0.481165  0.850229
4   5.0  1.453425  1.057737  0.165562  0.515018
5   6.0 -1.336936  0.562861  1.392855 -0.063328
6   7.0  0.121668  1.207603 -0.002040  1.627796
7   8.0  0.354493  1.037528 -0.385684  0.519818
8   9.0  1.686583 -1.325963  1.428984 -2.089354
9  10.0 -0.129820  0.631523 -0.586538  0.290720

In [2]:
def color_negative_red(val):
    """
    It takes a scalar and returns a string with
    the CSS property 'color:red' for negative
    strings, black otherwise
    """
    color = 'red' if val < 0 else 'black'
    return 'color: %s' % color

In [3]:
df.style.applymap(color_negative_red)

applymap method allows us to interact with each element.

In [112]:
def highlight_max(s):
    """
    highlight the maximum in a Series yellow.
    """
    is_max = s == s.max()
    return ['background-color: yellow' if v else '' for v in is_max]

In [113]:
df.style.apply(highlight_max)

Through the last method (apply) we could interact with each column.

In [114]:
df.style.apply(highlight_max).applymap(color_negative_red)

Another useful method that will help us to find non values with styling is this:

In [115]:
df.style.highlight_null(null_color='red')

## Load data

We can have different situations in order to load the data to process in our data projects, such as, we can have the data in our local computer, we would like to load the data from an open repository by an specific URL, and the data are located in the cloud with some aditional steps to make in code (login-security and other activities related with the technnology).

### Datasets available

A lot of datasets are available in order to learn about the data science world, some libraries like scikit-learn and tensorflow allow us to load recononized datasets that have excellent tutorials, for example, in the next URL we can have the information about the datasets.

+ http://scikit-learn.org/stable/datasets/index.html

In [2]:
# we will load the data from the Boston datasets from the scikit learn 

from sklearn.datasets import load_boston
boston = load_boston()
print(boston.data.shape)

(506, 13)

### Open source repositories

Pandas has some methods to load the data in different shapes in a DataFrame 
We will use Iris dataset and the National Project, the data dictionaries can be found in these URLs:
+ https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.names
+ https://www.kaggle.com/nationalparkservice/park-biodiversity/data
+ https://archive.ics.uci.edu/ml/datasets/Car+Evaluation

The next code lines will download a dataset from the repository of the University of California and save it in a Dataframe

### CSV

In [2]:
import pandas as pd

# the next code will load the data but without the column names, so in the second line we can define them
#df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header=None)
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', 
                 header=None, names=["sepal_length","sepal_width", "petal_length","petal_width","class"])

# the idea with this dataset is to explore some elements through pandas that Iris does not provide, 
# such as categorical variables, specifically, the method provides with index_col to select what is the main column to identify
# each row
df_park = pd.read_csv('../datasets/parks.csv', index_col=['Park Code'], encoding='utf-8')

Another way is to save the dataset in your local computer in a csv file, the next code will do it

In [63]:
import requests 
import csv
data = requests.get('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data')
with open("../datasets/name.csv", "w+") as f:
    writer = csv.writer(f)
    reader = csv.reader(data.text.splitlines())
    for row in reader:
        writer.writerow(row)
data = pd.read_csv("../datasets/name.csv")                    
data.head()

   vhigh vhigh.1  2 2.1  small   low  unacc
0  vhigh   vhigh  2   2  small   med  unacc
1  vhigh   vhigh  2   2  small  high  unacc
2  vhigh   vhigh  2   2    med   low  unacc
3  vhigh   vhigh  2   2    med   med  unacc
4  vhigh   vhigh  2   2    med  high  unacc

Pandas has several methods to read different types of files, we can find more information in it's webpage:

https://pandas.pydata.org/pandas-docs/stable/reference/io.html

Some of the files that we can process using this are:

+ HTML
+ JSON
+ Excel
+ SQL
+ SAS
+ Google BigQuery
+ STATA

In [65]:
pd.read_table("http://bit.ly/chiporders").head()

/opt/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### JSON

In [109]:
# hay que tener encuenta que el json debe estar normalizado

pd.read_json("https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json").head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

In [1]:
import pandas as pd

We can find a difference between read_excel and ExcelFile, the second is a class for parsing tabular excel sheets into a DataFrame  and the first is one is a method that allows us to load both 'xls' and 'xlsx' file extensions from a local filesystem or URL.

In [3]:
#df_excel =  pd.ExcelFile
?pd.read_excel

### EXCEL

In [2]:
"""
We are going to use the next files downloaded from
https://pbpython.com/excel-file-combine.html
https://github.com/marsja/jupyter/blob/master/example_sheets2.xlsx
"""
# For the next example we are going to load an excel that has two sheets
# by default the method load_excel uses the position 0
#df = pd.read_excel("../../../datasets/example_sheets2.xlsx")
# let's load the second sheet by its index
#df = pd.read_excel("../../../datasets/example_sheets2.xlsx", sheet_name=1)
# let's load the second sheet by it's label b
df = pd.read_excel("../datasets/example_sheets2.xlsx", sheet_name="Session2")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
Name       10 non-null object
ID         10 non-null int64
Mean       9 non-null float64
Correct    9 non-null float64
Session    10 non-null int64
dtypes: float64(2), int64(2), object(1)
memory usage: 480.0+ bytes

In [3]:
# Now we are going to see the difference to load the data using the parameter sheet with None
df = pd.read_excel("../datasets/example_sheets2.xlsx", sheet_name=None)
type(df)
# we got a python dictionary where each key is the sheet identification from the excel
#print(df.keys())

collections.OrderedDict

In [ ]:
# With the keys we can the information from each sheet, pay attention that they are DataFrames 
# type(df['Session1'])
df = df['Session1']
df.info()

A common problem that we might face is the format in the excel file, let's analyze the next file downladed from the next repository:

<img src="../Utilities/excel_problem.png" >
<center> 
https://www.kaggle.com/plsms21/xls-files-all/downloads/xls-files-all.zip/1 </center>

At the last capture we can see that the file many sheets, as we saw we can make a dataframe calling one of them, but what is going to on with it's format?

In [6]:
pd.read_excel("../Datasets/xls-files-all/WICAgencies2013ytd.xls", sheet_name='Total Women').head()

,WIC PROGRAM -- TOTAL NUMBER OF WOMEN PARTICIPATING,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,FISCAL YEAR 2013,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"Data as of October 05, 2018",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,State Agency or Indian Tribal Organization,2012-10-01 00:00:00,2012-11-01 00:00:00,2012-12-01 00:00:00,2013-01-01 00:00:00,2013-02-01 00:00:00,2013-03-01 00:00:00,2013-04-01 00:00:00,2013-05-01 00:00:00,2013-06-01 00:00:00,2013-07-01 00:00:00,2013-08-01 00:00:00,2013-09-01 00:00:00,Average Participation
4,Connecticut,11891,11763,11328,11786,11159,11070,11379,11666,11387,11587,11570,11376,11496.8

The excel's format influenced in how the data was loaded.

### SQL
https://dev.mysql.com/doc/connector-python/en/connector-python-example-connecting.html

Primero es necesario establecer una conexiÃ³n con nuestro motor de base de datos, para ello utilizaremos el paquete pyodbc

### SQLite

I'm going to use the data from the next repository

https://www.kaggle.com/rtatman/188-million-us-wildfires/downloads/188-million-us-wildfires.zip/1

We can use the package **sqlite3** to manage the databases.

In [15]:
import sqlite3
# let's make the connection with our database
conn = sqlite3.connect("../Datasets/FPA_FOD_20170508.sqlite")
# we are going to use pandas to query a table
fires = pd.read_sql_query("SELECT * FROM Fires", conn)
fires.head()

,OBJECTID,FOD_ID,FPA_ID,SOURCE_SYSTEM_TYPE,SOURCE_SYSTEM,NWCG_REPORTING_AGENCY,NWCG_REPORTING_UNIT_ID,NWCG_REPORTING_UNIT_NAME,SOURCE_REPORTING_UNIT,SOURCE_REPORTING_UNIT_NAME,...,FIRE_SIZE_CLASS,LATITUDE,LONGITUDE,OWNER_CODE,OWNER_DESCR,STATE,COUNTY,FIPS_CODE,FIPS_NAME,Shape
0,1,1,FS-1418826,FED,FS-FIRESTAT,FS,USCAPNF,Plumas National Forest,0511,Plumas National Forest,...,A,40.036944,-121.005833,5.0,USFS,CA,63,063,Plumas,b'\x00\x01\xad\x10\x00\x00\xe8d\xc2\x92_@^\xc0...
1,2,2,FS-1418827,FED,FS-FIRESTAT,FS,USCAENF,Eldorado National Forest,0503,Eldorado National Forest,...,A,38.933056,-120.404444,5.0,USFS,CA,61,061,Placer,b'\x00\x01\xad\x10\x00\x00T\xb6\xeej\xe2\x19^\...
2,3,3,FS-1418835,FED,FS-FIRESTAT,FS,USCAENF,Eldorado National Forest,0503,Eldorado National Forest,...,A,38.984167,-120.735556,13.0,STATE OR PRIVATE,CA,17,017,El Dorado,b'\x00\x01\xad\x10\x00\x00\xd0\xa5\xa0W\x13/^\...
3,4,4,FS-1418845,FED,FS-FIRESTAT,FS,USCAENF,Eldorado National Forest,0503,Eldorado National Forest,...,A,38.559167,-119.913333,5.0,USFS,CA,3,003,Alpine,b'\x00\x01\xad\x10\x00\x00\x94\xac\xa3\rt\xfa]...
4,5,5,FS-1418847,FED,FS-FIRESTAT,FS,USCAENF,Eldorado National Forest,0503,Eldorado National Forest,...,A,38.559167,-119.933056,5.0,USFS,CA,3,003,Alpine,b'\x00\x01\xad\x10\x00\x00@\xe3\xaa.\xb7\xfb]\...

## Rename columns

We have a lot of ways to change the columns in our dataset, we are going to see some of them, but first, it is important how to get information about our dimensions.

In [116]:
df_park = pd.read_csv('https://raw.githubusercontent.com/urcuqui/Data-Science/master/datasets/parks.csv', index_col=['Park Code'], encoding='utf-8')
df_park.info()

<class 'pandas.core.frame.DataFrame'>
Index: 56 entries, ACAD to ZION
Data columns (total 5 columns):
Park Name    56 non-null object
State        56 non-null object
Acres        56 non-null int64
Latitude     56 non-null float64
Longitude    56 non-null float64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.6+ KB

In [117]:
print(df_park.shape)
print("")
print(len(df_park))
print("")
print(df_park.columns)

(56, 5)

56

Index(['Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

An easy way to change our column names is by the method **rename()** which receives a dictionary where the keys are the old names and their values will be the new column names.

In [118]:
df_park.rename({'Park Name': 'park_name', 'State': 'state', 'Acres': 'acres', 'Latitude': 'latitude', 
                'Longitude': 'longitude'}, axis='columns').copy().head()

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25
BISC       Biscayne National Park    FL  172924     25.65     -80.08

In some ocasions we might face with column names that have upper letters and spaces, in order to keep column names to a standard we can use the next methods.

In [119]:
df_park.columns.str.replace(' ', '_')

Index(['Park_Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

In [120]:
# the next line gets each column name and applies the replace and lower methods
[col.replace(' ', '_').lower() for col in df_park.columns]

['park_name', 'state', 'acres', 'latitude', 'longitude']

## Change Column Types

We have different ways to change the types of our columns, let's see some of them

In [16]:
data = pd.read_csv("../datasets/parks.csv", index_col=['Park Code'], encoding='utf-8')
data.dtypes

Park Name     object
State         object
Acres          int64
Latitude     float64
Longitude    float64
dtype: object

the method astype("type to change") allows us to change the type of a specific column

In [12]:
#data.State = data.State.astype("category")
data['State'] = data['State'].astype("category")
data.dtypes

Park Name      object
State        category
Acres           int64
Latitude      float64
Longitude     float64
dtype: object

In [15]:
# change all the columns
data.astype("object").dtypes

Park Name    object
State        object
Acres        object
Latitude     object
Longitude    object
dtype: object

Pandas has another way to change the columns by methods that start with  `to_*`, for example `to_numeric()` and `to_datetime`

**Advices**: 
+ the method only receives a Serie object.
+ this is the URL https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior to review the format for datetimes

In [41]:
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
serie_dates = pd.Series(["1970-01-01", "1980-01-01", "2019-03-01", "2019-02-16"])
pd.to_datetime(serie_dates, format='%Y-%m-%d')

0   1970-01-01
1   1980-01-01
2   2019-03-01
3   2019-02-16
dtype: datetime64[ns]

## Data Persistence

We can write our data in a DataFrame file for future works, Pandas provides a set of writing methods, some of them are:
```
+ to_csv:	Write object to a comma-separated values (csv) file.
+ to_excel():	Write object to an Excel sheet.
+ to_gbq():	Write a DataFrame to a Google BigQuery table.
+ to_hdf():	Write the contained data to an HDF5 file using HDFStore.
+ to_html():	Render a DataFrame as an HTML table.
+ to_json():	Convert the object to a JSON string.
+ to_latex():	Render an object to a LaTeX tabular environment table.
+ to_pickle():	Pickle (serialize) object to file.
```
If you need more information about it you can check in the Pandas documentation.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

In [18]:
# let's make a dataframe
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data = pd.DataFrame(data, index=['indice1', 'indice2', 'indice3','indice4', 'indice5', 'indice6'])
# we are going to write the last object in a csv file
data.to_csv("prueba.csv")
# we are going to erase the object dataframe
del data
# let's load the new csv previously made
pd.read_csv("prueba.csv").head()

  Unnamed: 0   state  year  pop
0    indice1    Ohio  2000  1.5
1    indice2    Ohio  2001  1.7
2    indice3    Ohio  2002  3.6
3    indice4  Nevada  2001  2.4
4    indice5  Nevada  2002  2.9

Note that the indexes were stored as a column, we should take them into account again when we load the dataset.

In [19]:
pd.read_csv("prueba.csv", index_col=0).head()

          state  year  pop
indice1    Ohio  2000  1.5
indice2    Ohio  2001  1.7
indice3    Ohio  2002  3.6
indice4  Nevada  2001  2.4
indice5  Nevada  2002  2.9

## Exploration

Know the datatypes for each column

In [7]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
class            object
dtype: object

Print the first three rows

In [40]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa

In [64]:
df_park.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

We can get the data behind a variable in different ways, the first one is calling it like an attribute from the object DataFrame.

In [8]:
df_park.park_name.head(3)

Park Code
ACAD      Acadia National Park
ARCH      Arches National Park
BADL    Badlands National Park
Name: park_name, dtype: object

Another way is to calling is like a Python dictionary where each key is the variable's name.

In [9]:
df_park['park_name'].head(3)

Park Code
ACAD      Acadia National Park
ARCH      Arches National Park
BADL    Badlands National Park
Name: park_name, dtype: object

Note that the type of the last data is an object Series.

In [14]:
type(data['park_name'])

pandas.core.series.Series

Now if we want to get the values in the object Series we can use indexes associated to each register, like this

In [19]:
print(type(data['park_name'][0]))
data['park_name'][1:3]

<class 'str'>

Park Code
ARCH      Arches National Park
BADL    Badlands National Park
Name: park_name, dtype: object

Get and print a specific row

In [20]:
data.iloc[0]

park_name    Acadia National Park
state                          ME
acres                       47390
latitude                    44.35
longitude                  -68.21
Name: ACAD, dtype: object

Get values through your dataframe's indexes:
+ loc() receives a string index or an array of string indexes
+ iloc() receives the position index or an array of position indexes (int)

The sintax of these methods is [row, column]

In [24]:
data.iloc[1,2:4]

acres       76519
latitude    38.68
Name: ARCH, dtype: object

In [25]:
# it also possible to pass a list
data.iloc[1:3, [1,2]]

          state   acres
Park Code
ARCH         UT   76519
BADL         SD  242756

In [31]:
data.index # we got the indexes associated to each register

Index(['ACAD', 'ARCH', 'BADL', 'BIBE', 'BISC', 'BLCA', 'BRCA', 'CANY', 'CARE',
       'CAVE', 'CHIS', 'CONG', 'CRLA', 'CUVA', 'DENA', 'DEVA', 'DRTO', 'EVER',
       'GAAR', 'GLAC', 'GLBA', 'GRBA', 'GRCA', 'GRSA', 'GRSM', 'GRTE', 'GUMO',
       'HALE', 'HAVO', 'HOSP', 'ISRO', 'JOTR', 'KATM', 'KEFJ', 'KOVA', 'LACL',
       'LAVO', 'MACA', 'MEVE', 'MORA', 'NOCA', 'OLYM', 'PEFO', 'PINN', 'REDW',
       'ROMO', 'SAGU', 'SEKI', 'SHEN', 'THRO', 'VOYA', 'WICA', 'WRST', 'YELL',
       'YOSE', 'ZION'],
      dtype='object', name='Park Code')

In [32]:
data.loc['ACAD', 'latitude']

44.35

In [35]:
print(df_park.loc["ACAD"])
print("")
print(df_park.loc[["ACAD","ARCH"]]) # we got two registers associated to ACAD and ARCH
print("")
print(df_park.iloc[[1,2]])
print()
print(df_park.loc[:,["latitude", "acres"]])

park_name    Acadia National Park
state                          ME
acres                       47390
latitude                    44.35
longitude                  -68.21
Name: ACAD, dtype: object

                      park_name state  acres  latitude  longitude
Park Code
ACAD       Acadia National Park    ME  47390     44.35     -68.21
ARCH       Arches National Park    UT  76519     38.68    -109.57

                        park_name state   acres  latitude  longitude
Park Code
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

           latitude    acres
Park Code
ACAD          44.35    47390
ARCH          38.68    76519
BADL          43.75   242756
BIBE          29.25   801163
BISC          25.65   172924
BLCA          38.57    32950
BRCA          37.57    35835
CANY          38.20   337598
CARE          38.20   241904
CAVE          32.17    46766
CHIS          34.01   249561
CONG          33.78    26546
CRLA          42.94   183224
CUVA          41.24    32950
DENA          63.33  3372402
DEVA          36.24  4740912
DRTO          24.63    64701
EVER          25.32  1508538
GAAR          67.78  7523898
GLAC          48.80  1013572
GLBA          58.50  3224840
GRBA          38.98    77180
GRCA          36.06  1217403
GRSA          37.73    42984
GRSM          35.68   521490
GRTE          43.73   309995
GUMO          31.92    86416
HALE          20.72    29094
HAVO          19.38   323431
HOSP          34.51     5550
ISRO          48.10   571790
JOTR          33.79   789745
KATM          58.50  3674530
KEFJ          59.92   669983
KOVA          67.55  1750717
LACL          60.97  2619733
LAVO          40.49   106372
MACA          37.18    52830
MEVE          37.18    52122
MORA          46.85   235625
NOCA          48.70   504781
OLYM          47.97   922651
PEFO          35.07    93533
PINN          36.48    26606
REDW          41.30   112512
ROMO          40.40   265828
SAGU          32.25    91440
SEKI          36.43   865952
SHEN          38.53   199045
THRO          46.97    70447
VOYA          48.50   218200
WICA          43.57    28295
WRST          61.00  8323148
YELL          44.60  2219791
YOSE          37.83   761266
ZION          37.30   146598

In [37]:
# we can use both methods
df_park.iloc[1:3].loc[:,['state','park_name']]

          state               park_name
Park Code
ARCH         UT    Arches National Park
BADL         SD  Badlands National Park

We can manipulate the index.

In [41]:
df_park.set_index('state')

,park_name,acres,latitude,longitude
state,,,,
ME,Acadia National Park,47390,44.35,-68.21
UT,Arches National Park,76519,38.68,-109.57
SD,Badlands National Park,242756,43.75,-102.50
TX,Big Bend National Park,801163,29.25,-103.25
FL,Biscayne National Park,172924,25.65,-80.08
CO,Black Canyon of the Gunnison National Park,32950,38.57,-107.72
UT,Bryce Canyon National Park,35835,37.57,-112.18
UT,Canyonlands National Park,337598,38.20,-109.93
UT,Capitol Reef National Park,241904,38.20,-111.17
NM,Carlsbad Caverns National Park,46766,32.17,-104.44
CA,Channel Islands National Park,249561,34.01,-119.42
SC,Congaree National Park,26546,33.78,-80.78
OR,Crater Lake National Park,183224,42.94,-122.10
OH,Cuyahoga Valley National Park,32950,41.24,-81.55
AK,Denali National Park and Preserve,3372402,63.33,-150.50
"CA, NV",Death Valley National Park,4740912,36.24,-116.82
FL,Dry Tortugas National Park,64701,24.63,-82.87
FL,Everglades National Park,1508538,25.32,-80.93
AK,Gates Of The Arctic National Park and Preserve,7523898,67.78,-153.30
MT,Glacier National Park,1013572,48.80,-114.00
AK,Glacier Bay National Park and Preserve,3224840,58.50,-137.00
NV,Great Basin National Park,77180,38.98,-114.30
AZ,Grand Canyon National Park,1217403,36.06,-112.14
CO,Great Sand Dunes National Park and Preserve,42984,37.73,-105.51
"TN, NC",Great Smoky Mountains National Park,521490,35.68,-83.53
WY,Grand Teton National Park,309995,43.73,-110.80
TX,Guadalupe Mountains National Park,86416,31.92,-104.87
HI,Haleakala National Park,29094,20.72,-156.17
HI,Hawaii Volcanoes National Park,323431,19.38,-155.20
AR,Hot Springs National Park,5550,34.51,-93.05
MI,Isle Royale National Park,571790,48.10,-88.55
CA,Joshua Tree National Park,789745,33.79,-115.90
AK,Katmai National Park and Preserve,3674530,58.50,-155.00
AK,Kenai Fjords National Park,669983,59.92,-149.65
AK,Kobuk Valley National Park,1750717,67.55,-159.28
AK,Lake Clark National Park and Preserve,2619733,60.97,-153.42
CA,Lassen Volcanic National Park,106372,40.49,-121.51
KY,Mammoth Cave National Park,52830,37.18,-86.10
CO,Mesa Verde National Park,52122,37.18,-108.49
WA,Mount Rainier National Park,235625,46.85,-121.75
WA,North Cascades National Park,504781,48.70,-121.20
WA,Olympic National Park,922651,47.97,-123.50
AZ,Petrified Forest National Park,93533,35.07,-109.78
CA,Pinnacles National Park,26606,36.48,-121.16
CA,Redwood National Park,112512,41.30,-124.00
CO,Rocky Mountain National Park,265828,40.40,-105.58
AZ,Saguaro National Park,91440,32.25,-110.50
CA,Sequoia and Kings Canyon National Parks,865952,36.43,-118.68
VA,Shenandoah National Park,199045,38.53,-78.35
ND,Theodore Roosevelt National Park,70447,46.97,-103.45
MN,Voyageurs National Park,218200,48.50,-92.88
SD,Wind Cave National Park,28295,43.57,-103.48
AK,Wrangell - St Elias National Park and Preserve,8323148,61.00,-142.00
"WY, MT, ID",Yellowstone National Park,2219791,44.60,-110.50
CA,Yosemite National Park,761266,37.83,-119.50
UT,Zion National Park,146598,37.30,-113.05

The next lines determine the number of rows and columns in the dataset, the specific number of rows and how get the column names.

In [89]:
print(df.shape)
print("")
print(len(df))
print("")
print(df_park.columns)
print("")
print(df.columns)

(150, 5)

150

Index(['Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'], dtype='object')

Get the data by column name and the number of rows to display

In [94]:
print(df_park['State'][:2])
print("")
print(df['sepal_length'][:5])
print("")
#see how the columns are maped in the data_frame and how we can call it
print(df_park.Acres.head(2))

Park Code
ACAD    ME
ARCH    UT
Name: State, dtype: object

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

Park Code
ACAD    47390
ARCH    76519
Name: Acres, dtype: int64

In our dataset of parks the column "Park Name" has a space separator between the words, one recommendation is to have a simple words connected by a character, for example we will use _ in the next code:

In [65]:
df_park.columns = [col.replace(' ','_').lower() for col in df_park.columns]
print(df_park.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

If you need a subset of your data we can use the above methods, for example

In [6]:
df_park[['state','acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

Get and print a specific value in a row and column

In [13]:
print(df_park.state.iloc[2]) # note again that you can call the column and next use iloc method
print("-----")
print(df_park.state.iloc[[2]]) # it is totally different from the previous example, note that you are printing the object propierties

SD
-----
Park Code
BADL    SD
Name: state, dtype: object

Filtering the data by conditions through the columns and the values in rows (Similar to R)

In [15]:
df_park[df_park.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

#### Conditional selection

Some logical operators are:

+ ~ it is "not"
+ | it is "or"
+ & it is "and"

In [16]:
df_park[(df_park.latitude > 60) | (df_park.acres > (10**6))].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

#### Other logical operators

In [7]:
df_park[df_park.state.isin(['AK', 'CA'])]

,park_name,state,acres,latitude,longitude
Park Code,,,,,
CHIS,Channel Islands National Park,CA,249561,34.01,-119.42
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
GAAR,Gates Of The Arctic National Park and Preserve,AK,7523898,67.78,-153.30
GLBA,Glacier Bay National Park and Preserve,AK,3224840,58.50,-137.00
JOTR,Joshua Tree National Park,CA,789745,33.79,-115.90
KATM,Katmai National Park and Preserve,AK,3674530,58.50,-155.00
KEFJ,Kenai Fjords National Park,AK,669983,59.92,-149.65
KOVA,Kobuk Valley National Park,AK,1750717,67.55,-159.28
LACL,Lake Clark National Park and Preserve,AK,2619733,60.97,-153.42
LAVO,Lassen Volcanic National Park,CA,106372,40.49,-121.51
PINN,Pinnacles National Park,CA,26606,36.48,-121.16
REDW,Redwood National Park,CA,112512,41.30,-124.00
SEKI,Sequoia and Kings Canyon National Parks,CA,865952,36.43,-118.68
WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.00,-142.00
YOSE,Yosemite National Park,CA,761266,37.83,-119.50

Get a count of the unique values of a column

In [35]:
print(df_park.shape)
len(df_park.park_name.unique()) # it allows to know that each park is unique in our dataset

(56, 5)

56

### lambda

It is another important concept to apply in the searching process, it allows us to have more complex querys.

In [19]:
# the next code provides the park's names with a length of 3
df_park[df_park['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

## Cleaning

In some situations you have to work with datasets with bad values, due the problems originated in their registration process (by a human error or a machine failure), problems related to the integrity of the data, data format, and other kind of situations that influence in the information. It is an important activity because the future analyses depend of this work.

In [2]:
# for example, you have the next list of states, pay attention of the format and the values, are they ok?

states = ['  Alabama', 'Georgia!', 'georgia', 'Fl0rIda', 'south  Carolina##', 'West virginia?']

In [9]:
import re # regular expression package
def clean_strings(strings):
    result = []
    for value in strings:
        value = value.strip() # this method will erase all the whitespace characters by default
        value = re.sub('[!#?]', '', value) # it will return a string by replacing the leftmost non overlapping occurrences of pattern
        value = value.title() # it will change the first character in each word to Uppercase and remaining characters to Lowercase
        result.append(value)
    return result

In [10]:
print(clean_strings(states))

['Alabama', 'Georgia', 'Georgia', 'Fl0Rida', 'South  Carolina', 'West Virginia']

### Get only a dataframe without NA's

In a exploratory data analysis is important to know the rows that have non values, the aim is to explore what happened during the capture process and what will do to resolve it. two methods to help us are:

+ isin, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.isin.html
+ isnull, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html

In [66]:
print("data without non values in the state feature")
print(df_park[df_park.state.isin(["WA","OR","CA"])].head())
print("")
print("data with non values")
print("")
print(df_park.isna().head())

data without non values in the state feature
                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

data with non values

           park_name  state  acres  latitude  longitude
Park Code
ACAD           False  False  False     False      False
ARCH           False  False  False     False      False
BADL           False  False  False     False      False
BIBE           False  False  False     False      False
BISC           False  False  False     False      False

### Descriptive stadistics

Pandas allows us to get the descriptive stadistics from our dataframe, let's use it.

## References

+ McKinney, W. (2012). Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.".
+ https://www.kaggle.com/sohier/tutorial-accessing-data-with-pandas/
+ http://wavedatalab.github.io/datawithpython/munge.html
+ https://cloud.google.com/bigquery/docs/bigquery-storage-python-pandas